In [ ]:
import pandas as pd

In [ ]:
df= pd.read_csv('Titanic.csv')

In [ ]:
df.head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1             2         1       1  ...  71.2833   C85         C
3             4         1       1  ...  53.1000  C123         S
6             7         0       1  ...  51.8625   E46         S
10           11         1       3  ...  16.7000    G6         S
11           12         1       1  ...  26.5500  C103         S

[5 rows x 12 columns]

In [ ]:
df.dropna(inplace= True)

In [ ]:
x=df.drop(['Survived','Name','PassengerId','Ticket','Embarked','Cabin','SibSp','Pclass','Age'] ,axis=1)

In [ ]:
y= df['Survived']

In [ ]:
x

        Sex   Age  Parch     Fare
1    female  38.0      0  71.2833
3    female  35.0      0  53.1000
6      male  54.0      0  51.8625
10   female   4.0      1  16.7000
11   female  58.0      0  26.5500
..      ...   ...    ...      ...
871  female  47.0      1  52.5542
872    male  33.0      0   5.0000
879  female  56.0      1  83.1583
887  female  19.0      0  30.0000
889    male  26.0      0  30.0000

[183 rows x 4 columns]

In [ ]:
from sklearn.preprocessing import LabelEncoder

In [ ]:
le_sex= LabelEncoder()

In [ ]:
x['Sex']=le_sex.fit_transform(x['Sex'])

In [ ]:
x

     Sex  Parch     Fare
1      0      0  71.2833
3      0      0  53.1000
6      1      0  51.8625
10     0      1  16.7000
11     0      0  26.5500
..   ...    ...      ...
871    0      1  52.5542
872    1      0   5.0000
879    0      1  83.1583
887    0      0  30.0000
889    1      0  30.0000

[183 rows x 3 columns]

In [ ]:
from sklearn import tree

In [ ]:
model=tree.DecisionTreeClassifier().fit(x,y)

In [ ]:
model.score(x,y)

0.9453551912568307